Repository: AhmedFarid/Nazareth
Catalog: Nazareth/*.lproj/Localizable.strings
Languages: he

source: Are
he: הם

source: Contact us filed
he: צור קשר

source: Done
he: בוצע

source: email not correct
he: הדוא"ל לא תקין

source: en
he: hr

source: enter rate or chose categour
he: הזן שיעור או בחר קטגוריה

source: enter your comment
he: הזן את התגובה שלך

source: enter your Email
he: הזן שיעור או בחר קטגוריה

source: enter your message
he: הזן את ההודעה שלך

source: enter your name
he: הזן את שמך

source: enter your phone
he: הזן את הטלפון שלך

source: filter
he: פילטר

source: Ok
he: בסדר

source: person review
he: ביקורת אדם

source: Review Filed
he: סקירה

source: Similar
he: דומה

source: Where The
he: איפה ה
